espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG13P/Include/efr32mg13p632f512gm48.h
/* Bit fields for CMU ROUTELOC1 */
#define _CMU_ROUTELOC1_RESETVALUE                         0x00000000UL                            /**< Default value for CMU_ROUTELOC1 */
#define _CMU_ROUTELOC1_MASK                               0x00000007UL                            /**< Mask for CMU_ROUTELOC1 */
#define _CMU_ROUTELOC1_CLKIN0LOC_SHIFT                    0                                       /**< Shift value for CMU_CLKIN0LOC */
#define _CMU_ROUTELOC1_CLKIN0LOC_MASK                     0x7UL                                   /**< Bit mask for CMU_CLKIN0LOC */
#define _CMU_ROUTELOC1_CLKIN0LOC_LOC0                     0x00000000UL                            /**< Mode LOC0 for CMU_ROUTELOC1 */
#define _CMU_ROUTELOC1_CLKIN0LOC_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for CMU_ROUTELOC1 */
#define _CMU_ROUTELOC1_CLKIN0LOC_LOC1                     0x00000001UL                            /**< Mode LOC1 for CMU_ROUTELOC1 */
#define _CMU_ROUTELOC1_CLKIN0LOC_LOC2                     0x00000002UL                            /**< Mode LOC2 for CMU_ROUTELOC1 */
#define _CMU_ROUTELOC1_CLKIN0LOC_LOC3                     0x00000003UL                            /**< Mode LOC3 for CMU_ROUTELOC1 */
#define _CMU_ROUTELOC1_CLKIN0LOC_LOC4                     0x00000004UL                            /**< Mode LOC4 for CMU_ROUTELOC1 */
#define CMU_ROUTELOC1_CLKIN0LOC_LOC0                      (_CMU_ROUTELOC1_CLKIN0LOC_LOC0 << 0)    /**< Shifted mode LOC0 for CMU_ROUTELOC1 */
#define CMU_ROUTELOC1_CLKIN0LOC_DEFAULT                   (_CMU_ROUTELOC1_CLKIN0LOC_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_ROUTELOC1 */
#define CMU_ROUTELOC1_CLKIN0LOC_LOC1                      (_CMU_ROUTELOC1_CLKIN0LOC_LOC1 << 0)    /**< Shifted mode LOC1 for CMU_ROUTELOC1 */
#define CMU_ROUTELOC1_CLKIN0LOC_LOC2                      (_CMU_ROUTELOC1_CLKIN0LOC_LOC2 << 0)    /**< Shifted mode LOC2 for CMU_ROUTELOC1 */
#define CMU_ROUTELOC1_CLKIN0LOC_LOC3                      (_CMU_ROUTELOC1_CLKIN0LOC_LOC3 << 0)    /**< Shifted mode LOC3 for CMU_ROUTELOC1 */
#define CMU_ROUTELOC1_CLKIN0LOC_LOC4                      (_CMU_ROUTELOC1_CLKIN0LOC_LOC4 << 0)    /**< Shifted mode LOC4 for CMU_ROUTELOC1 */

/* Bit fields for CMU LOCK */
#define _CMU_LOCK_RESETVALUE                              0x00000000UL                      /**< Default value for CMU_LOCK */
#define _CMU_LOCK_MASK                                    0x0000FFFFUL                      /**< Mask for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_SHIFT                           0                                 /**< Shift value for CMU_LOCKKEY */
#define _CMU_LOCK_LOCKKEY_MASK                            0xFFFFUL                          /**< Bit mask for CMU_LOCKKEY */
#define _CMU_LOCK_LOCKKEY_DEFAULT                         0x00000000UL                      /**< Mode DEFAULT for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_UNLOCKED                        0x00000000UL                      /**< Mode UNLOCKED for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_LOCK                            0x00000000UL                      /**< Mode LOCK for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_LOCKED                          0x00000001UL                      /**< Mode LOCKED for CMU_LOCK */
#define _CMU_LOCK_LOCKKEY_UNLOCK                          0x0000580EUL                      /**< Mode UNLOCK for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_DEFAULT                          (_CMU_LOCK_LOCKKEY_DEFAULT << 0)  /**< Shifted mode DEFAULT for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_UNLOCKED                         (_CMU_LOCK_LOCKKEY_UNLOCKED << 0) /**< Shifted mode UNLOCKED for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_LOCK                             (_CMU_LOCK_LOCKKEY_LOCK << 0)     /**< Shifted mode LOCK for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_LOCKED                           (_CMU_LOCK_LOCKKEY_LOCKED << 0)   /**< Shifted mode LOCKED for CMU_LOCK */
#define CMU_LOCK_LOCKKEY_UNLOCK                           (_CMU_LOCK_LOCKKEY_UNLOCK << 0)   /**< Shifted mode UNLOCK for CMU_LOCK */

/* Bit fields for CMU HFRCOSS */
#define _CMU_HFRCOSS_RESETVALUE                           0x00000000UL                      /**< Default value for CMU_HFRCOSS */
#define _CMU_HFRCOSS_MASK                                 0x00001F07UL                      /**< Mask for CMU_HFRCOSS */
#define _CMU_HFRCOSS_SSAMP_SHIFT                          0                                 /**< Shift value for CMU_SSAMP */
#define _CMU_HFRCOSS_SSAMP_MASK                           0x7UL                             /**< Bit mask for CMU_SSAMP */
#define _CMU_HFRCOSS_SSAMP_DEFAULT                        0x00000000UL                      /**< Mode DEFAULT for CMU_HFRCOSS */
#define CMU_HFRCOSS_SSAMP_DEFAULT                         (_CMU_HFRCOSS_SSAMP_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_HFRCOSS */
#define _CMU_HFRCOSS_SSINV_SHIFT                          8                                 /**< Shift value for CMU_SSINV */
#define _CMU_HFRCOSS_SSINV_MASK                           0x1F00UL                          /**< Bit mask for CMU_SSINV */
#define _CMU_HFRCOSS_SSINV_DEFAULT                        0x00000000UL                      /**< Mode DEFAULT for CMU_HFRCOSS */
#define CMU_HFRCOSS_SSINV_DEFAULT                         (_CMU_HFRCOSS_SSINV_DEFAULT << 8) /**< Shifted mode DEFAULT for CMU_HFRCOSS */

/* Bit fields for CMU LFRCLKSEL */
#define _CMU_LFRCLKSEL_RESETVALUE                         0x00000000UL                       /**< Default value for CMU_LFRCLKSEL */
#define _CMU_LFRCLKSEL_MASK                               0x00000007UL                       /**< Mask for CMU_LFRCLKSEL */
#define _CMU_LFRCLKSEL_LFR_SHIFT                          0                                  /**< Shift value for CMU_LFR */
#define _CMU_LFRCLKSEL_LFR_MASK                           0x7UL                              /**< Bit mask for CMU_LFR */
#define _CMU_LFRCLKSEL_LFR_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for CMU_LFRCLKSEL */
#define _CMU_LFRCLKSEL_LFR_DISABLED                       0x00000000UL                       /**< Mode DISABLED for CMU_LFRCLKSEL */
#define _CMU_LFRCLKSEL_LFR_LFRCO                          0x00000001UL                       /**< Mode LFRCO for CMU_LFRCLKSEL */
#define _CMU_LFRCLKSEL_LFR_LFXO                           0x00000002UL                       /**< Mode LFXO for CMU_LFRCLKSEL */
#define _CMU_LFRCLKSEL_LFR_ULFRCO                         0x00000004UL                       /**< Mode ULFRCO for CMU_LFRCLKSEL */
#define _CMU_LFRCLKSEL_LFR_PLFRCO                         0x00000005UL                       /**< Mode PLFRCO for CMU_LFRCLKSEL */
#define CMU_LFRCLKSEL_LFR_DEFAULT                         (_CMU_LFRCLKSEL_LFR_DEFAULT << 0)  /**< Shifted mode DEFAULT for CMU_LFRCLKSEL */
#define CMU_LFRCLKSEL_LFR_DISABLED                        (_CMU_LFRCLKSEL_LFR_DISABLED << 0) /**< Shifted mode DISABLED for CMU_LFRCLKSEL */
#define CMU_LFRCLKSEL_LFR_LFRCO                           (_CMU_LFRCLKSEL_LFR_LFRCO << 0)    /**< Shifted mode LFRCO for CMU_LFRCLKSEL */
#define CMU_LFRCLKSEL_LFR_LFXO                            (_CMU_LFRCLKSEL_LFR_LFXO << 0)     /**< Shifted mode LFXO for CMU_LFRCLKSEL */
#define CMU_LFRCLKSEL_LFR_ULFRCO                          (_CMU_LFRCLKSEL_LFR_ULFRCO << 0)   /**< Shifted mode ULFRCO for CMU_LFRCLKSEL */
#define CMU_LFRCLKSEL_LFR_PLFRCO                          (_CMU_LFRCLKSEL_LFR_PLFRCO << 0)   /**< Shifted mode PLFRCO for CMU_LFRCLKSEL */

/* Bit fields for CMU LFRCLKEN0 */
#define _CMU_LFRCLKEN0_RESETVALUE                         0x00000000UL                         /**< Default value for CMU_LFRCLKEN0 */
#define _CMU_LFRCLKEN0_MASK                               0x00000001UL                         /**< Mask for CMU_LFRCLKEN0 */
#define CMU_LFRCLKEN0_PRORTC                              (0x1UL << 0)                         /**< Protocol Real-Time Counter Clock Enable */
#define _CMU_LFRCLKEN0_PRORTC_SHIFT                       0                                    /**< Shift value for CMU_PRORTC */
#define _CMU_LFRCLKEN0_PRORTC_MASK                        0x1UL                                /**< Bit mask for CMU_PRORTC */
#define _CMU_LFRCLKEN0_PRORTC_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for CMU_LFRCLKEN0 */
#define CMU_LFRCLKEN0_PRORTC_DEFAULT                      (_CMU_LFRCLKEN0_PRORTC_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_LFRCLKEN0 */

/* Bit fields for CMU LFRPRESC0 */
#define _CMU_LFRPRESC0_RESETVALUE                         0x00000000UL                      /**< Default value for CMU_LFRPRESC0 */
#define _CMU_LFRPRESC0_MASK                               0x00000003UL                      /**< Mask for CMU_LFRPRESC0 */
#define _CMU_LFRPRESC0_PRORTC_SHIFT                       0                                 /**< Shift value for CMU_PRORTC */
#define _CMU_LFRPRESC0_PRORTC_MASK                        0x3UL                             /**< Bit mask for CMU_PRORTC */
#define _CMU_LFRPRESC0_PRORTC_DIV1                        0x00000000UL                      /**< Mode DIV1 for CMU_LFRPRESC0 */
#define _CMU_LFRPRESC0_PRORTC_DIV2                        0x00000001UL                      /**< Mode DIV2 for CMU_LFRPRESC0 */
#define _CMU_LFRPRESC0_PRORTC_DIV4                        0x00000002UL                      /**< Mode DIV4 for CMU_LFRPRESC0 */
#define CMU_LFRPRESC0_PRORTC_DIV1                         (_CMU_LFRPRESC0_PRORTC_DIV1 << 0) /**< Shifted mode DIV1 for CMU_LFRPRESC0 */
#define CMU_LFRPRESC0_PRORTC_DIV2                         (_CMU_LFRPRESC0_PRORTC_DIV2 << 0) /**< Shifted mode DIV2 for CMU_LFRPRESC0 */
#define CMU_LFRPRESC0_PRORTC_DIV4                         (_CMU_LFRPRESC0_PRORTC_DIV4 << 0) /**< Shifted mode DIV4 for CMU_LFRPRESC0 */

/** @} */
/** @} End of group EFR32MG13P632F512GM48_CMU */

/***************************************************************************//**
 * @addtogroup EFR32MG13P632F512GM48_PRORTC
 * @{
 * @defgroup EFR32MG13P632F512GM48_PRORTC_BitFields  PRORTC Bit Fields
 * @{
 ******************************************************************************/

/* Bit fields for PRORTC CTRL */
#define _PRORTC_CTRL_RESETVALUE           0x00000000UL                         /**< Default value for PRORTC_CTRL */
#define _PRORTC_CTRL_MASK                 0x00000007UL                         /**< Mask for PRORTC_CTRL */
#define PRORTC_CTRL_EN                    (0x1UL << 0)                         /**< RTC Enable */
#define _PRORTC_CTRL_EN_SHIFT             0                                    /**< Shift value for RTC_EN */
#define _PRORTC_CTRL_EN_MASK              0x1UL                                /**< Bit mask for RTC_EN */
#define _PRORTC_CTRL_EN_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for PRORTC_CTRL */
#define PRORTC_CTRL_EN_DEFAULT            (_PRORTC_CTRL_EN_DEFAULT << 0)       /**< Shifted mode DEFAULT for PRORTC_CTRL */
#define PRORTC_CTRL_DEBUGRUN              (0x1UL << 1)                         /**< Debug Mode Run Enable */
#define _PRORTC_CTRL_DEBUGRUN_SHIFT       1                                    /**< Shift value for RTC_DEBUGRUN */
#define _PRORTC_CTRL_DEBUGRUN_MASK        0x2UL                                /**< Bit mask for RTC_DEBUGRUN */
#define _PRORTC_CTRL_DEBUGRUN_DEFAULT     0x00000000UL                         /**< Mode DEFAULT for PRORTC_CTRL */
#define PRORTC_CTRL_DEBUGRUN_DEFAULT      (_PRORTC_CTRL_DEBUGRUN_DEFAULT << 1) /**< Shifted mode DEFAULT for PRORTC_CTRL */
#define PRORTC_CTRL_COMP0TOP              (0x1UL << 2)                         /**< Compare Channel 0 is Top Value */
#define _PRORTC_CTRL_COMP0TOP_SHIFT       2                                    /**< Shift value for RTC_COMP0TOP */
#define _PRORTC_CTRL_COMP0TOP_MASK        0x4UL                                /**< Bit mask for RTC_COMP0TOP */
#define _PRORTC_CTRL_COMP0TOP_DEFAULT     0x00000000UL                         /**< Mode DEFAULT for PRORTC_CTRL */
#define _PRORTC_CTRL_COMP0TOP_DISABLE     0x00000000UL                         /**< Mode DISABLE for PRORTC_CTRL */
#define _PRORTC_CTRL_COMP0TOP_ENABLE      0x00000001UL                         /**< Mode ENABLE for PRORTC_CTRL */
#define PRORTC_CTRL_COMP0TOP_DEFAULT      (_PRORTC_CTRL_COMP0TOP_DEFAULT << 2) /**< Shifted mode DEFAULT for PRORTC_CTRL */
#define PRORTC_CTRL_COMP0TOP_DISABLE      (_PRORTC_CTRL_COMP0TOP_DISABLE << 2) /**< Shifted mode DISABLE for PRORTC_CTRL */
#define PRORTC_CTRL_COMP0TOP_ENABLE       (_PRORTC_CTRL_COMP0TOP_ENABLE << 2)  /**< Shifted mode ENABLE for PRORTC_CTRL */

/* Bit fields for PRORTC CNT */
#define _PRORTC_CNT_RESETVALUE            0x00000000UL                   /**< Default value for PRORTC_CNT */
#define _PRORTC_CNT_MASK                  0xFFFFFFFFUL                   /**< Mask for PRORTC_CNT */
#define _PRORTC_CNT_CNT_SHIFT             0                              /**< Shift value for RTC_CNT */
#define _PRORTC_CNT_CNT_MASK              0xFFFFFFFFUL                   /**< Bit mask for RTC_CNT */
#define _PRORTC_CNT_CNT_DEFAULT           0x00000000UL                   /**< Mode DEFAULT for PRORTC_CNT */
#define PRORTC_CNT_CNT_DEFAULT            (_PRORTC_CNT_CNT_DEFAULT << 0) /**< Shifted mode DEFAULT for PRORTC_CNT */

/* Bit fields for PRORTC IF */
#define _PRORTC_IF_RESETVALUE             0x00000000UL                   /**< Default value for PRORTC_IF */
#define _PRORTC_IF_MASK                   0x00000007UL                   /**< Mask for PRORTC_IF */
#define PRORTC_IF_OF                      (0x1UL << 0)                   /**< Overflow Interrupt Flag */
#define _PRORTC_IF_OF_SHIFT               0                              /**< Shift value for RTC_OF */
#define _PRORTC_IF_OF_MASK                0x1UL                          /**< Bit mask for RTC_OF */
#define _PRORTC_IF_OF_DEFAULT             0x00000000UL                   /**< Mode DEFAULT for PRORTC_IF */
#define PRORTC_IF_OF_DEFAULT              (_PRORTC_IF_OF_DEFAULT << 0)   /**< Shifted mode DEFAULT for PRORTC_IF */
#define _PRORTC_IF_COMP_SHIFT             1                              /**< Shift value for RTC_COMP */
#define _PRORTC_IF_COMP_MASK              0x6UL                          /**< Bit mask for RTC_COMP */
#define _PRORTC_IF_COMP_DEFAULT           0x00000000UL                   /**< Mode DEFAULT for PRORTC_IF */
#define PRORTC_IF_COMP_DEFAULT            (_PRORTC_IF_COMP_DEFAULT << 1) /**< Shifted mode DEFAULT for PRORTC_IF */

